Repository: wp-plugins/share-this
Catalog: branches/1.x/translations/sharethis-1.4-v1-*.po
Languages: nl_nl

source: E-mail this, post to del.icio.us, etc.
nl_nl: E-mail dit artikel, plaats link op del.icio.us, etc.

source: Share This
nl_nl: Deel dit

source: Close
nl_nl: Sluiten

source: Social Web
nl_nl: Sociaal netwerk

source: E-mail It
nl_nl: Mail het

source: To Address:
nl_nl: Naar (e-mailadres):

source: Your Name:
nl_nl: Je naam:

source: Your Address:
nl_nl: Je e-mailadres:

source: Send It
nl_nl: Versturen

source: Share This :
nl_nl: Deel dit:

source: Posted in:
nl_nl: Geplaatst op:

source: Return to:
nl_nl: Terugzenden naar:

source: Powered by <a href="http://alexking.org/projects/wordpress">Share This</a>
nl_nl: Ondersteund door <a href="http://alexking.org/projects/wordpress">Share This</a>
